{
    "ID": "mermaid",
    "Name": "Wavecaller Mermaid",
    "Description": "Among the most intelligent and cunning of monsters are the mermaids. Stories of sirens and oceanic disappearances have glutted them. In the wake of the pearls, many mermaids fled deep into the ocean for safety and in curiosity. As the frenzy over the pearls dies off, they have begun to resurface. They use the pneuma generated by El Encantador's arrival to ply their trades and ravage the coasts with storms.",
    "Scale": 6,
    "Mechanics": "The Wavecaller Mermaid begins the fight with two *Seafoam Copies*. When the Wavecaller Mermaid gains a Secondary Success on a defense but is still struck, it consumes a *Seafoam Copy* and the Strike misses.",
    "BasicAction": "Step or Stride and all Mist Illusions Step up to 4, prioritizing characters without an adjacent Mist Illusion. If a Mist Illusion is adjacent to a target, use **Sea Spray** on all *Mist Illusions* within 2 squares of a target. Spend remaining actions on **Wave**.\n\n**Step:** 4 Squares\n**Stride:** 6 Squares\n\n**Sea Spray:** Ranged. Destroy any number of *Mist Illusions*. Characters in a Centered Starburst 2 of those *Mist Illusions* are targeted by this Strike. 24 Hollow.\n**Wave** - Ranged. 3x10 Line beginning adjacent to the Wavecaller Mermaid. 19 Bash.",
    "Size": "2x2",
    "ArmorClass": 11,
    "DamageThreshold": 355,
    "AttackCards": [
      "Coast Scouring Wave | Instinct becomes: If adjacent to a character, move. Uses **Tsunami** with remaining actions, prioritizing as many targets as possible.\n***Tsunami:*** *Ranged. 6xInfinity Line beginning on a map edge. Destroys **ALL** cover and terrain in its area. 27 Bash.*",
      "Illusory Hare | When this card is drawn, the Wavecaller Mermaid conjures a *Mist Illusion: Hare* adjacent to each character. **Sea Spray** deals 30 Shock this turn, and draws an additional Shock status on-hit.",
      "Illusory Hippo | When this card is drawn, the Wavecaller Mermaid gains a *Seafoam Copy* and conjures a *Mist Illusion: Hippo* adjacent to itself. The *Mist Illusion: Hippo* performs **Tidal Rampage**.\n***Tidal Rampage:*** *Ranged. 8 Normal Cone. 15 Bash.*",
      "Illusory Crabs | When this card is drawn the Wavecaller Mermaid gains a *Seafoam Copy* and conjures two *Mist Illusion: Crab*s adjacent to two different targets. *Mist Illusion: Crab*s have Lockdown and one Reaction, striking with **Condensation Claw**.\n***Condensation Claw:*** *Melee. 19 Shock.*",
      "Illusory Lions | When this card is drawn, the Wavecaller Mermaid conjures two *Mist Illusion: Lion*s adjacent to the two furthest characters. Each *Mist Illusion: Lion* prioritizes the character it was conjured adjacent to when moving, and uses **Pounce** after moving.\n***Pounce:*** *If adjacent to a character, they make a DC18 Save. On a failure, they cannot move and have -4 to defend until the end of their next turn.*"
    ],
    "IsPreview": false,
    "isRetired": true
  }