{
    "ID": "centipede",
    "Name": "Sky Centipede",
    "Description": "Bearers of fickle winds, Sky Centipedes are blown about by the currents of pneuma that come with great misfortune and disastrous storms. Their segmented insectoid bodies are held aloft by a thousand and one wings, each flap stirring up ill omen and misfortune as they scurry through the air.",
    "Scale": 3,
    "Mechanics": "The Sky Centipede inflicts Misfortune with some of its actions. The current card will list a number of action types that are Ill Omens, when a character performs an action of that type, that character clears all Misfortune and takes 6 Typeless damage per Misfortune cleared. One instance of Misfortune can be cleared as an action.",
    "Enrage": "Everyone takes 1 Misfortune, then makes a DC13 save. On a fail, they must perform an action of the current Ill Omen type on their turn.",
    "Stun": "When the Monster becomes Stunned, each character clears Misfortune in addition to the normal Stunned effects.",
    "Basic Action": "If not adjacent to a target, move to the closest target. Perform **Jaws That Catch** twice. Perform **Tail Whip** with remaining actions.\n\n**Stride:** 10 Squares.\n**Step:** 4 Squares.\n\n**Jaws That Catch:** Melee. 13 Typeless, On-Hit: suffer Misfortune\n**Tail Whip:** The Sky Centipede’s tail rotates halfway around its head. All characters the tail moves adjacent to during this rotation are targeted by this Strike. Melee. 18 Bash.",
    "Size": "1x4",
    "ArmorClass": 12,
    "DamageThreshold": 195,
    "EnrageThreshold": 40,
    "StunThreshold": 17,
    "AttackCards": [
      "Ill Winds Blow | *Ill Omen: Boost, Bane.*\nInstinct becomes:\nIf not adjacent, move to the nearest target. Perform **Fickle Winds** with remaining actions, prioritizing hitting as many targets as possible\n\n**Fickle Winds:** Melee. Normal 6 Cone. 10 Hollow, On-Hit: suffer Misfortune.",
      "Unrelenting Unluck | *Ill Omen: Utility, Defend.*\n**Tail Whip** gains Agile and rotates the entire way around the Sky Centipede’s head (effectively becoming a Starburst 3 centered on the head).\nThe Monster’s Instinct becomes:\nIf not adjacent to a character, move so the Head is within 3 squares of as many targets as possible. Perform **Tail Whip** with remaining actions.", 
      "Whirlwind | *Ill Omen: Boost, Utility.*\nUtility. Inflict Knockback 5 towards the Sky Centipede on all characters. Characters who end this Knockback adjacent to the Sky Centipede take 14 Typeless and 2 Misfortune.",
      "Fickle Gale | *Ill Omen: Bane, Movement (Grimoire-granted Movement actions, not Stride and Step).*\nReplace **Jaws that Catch** with **Fellwind Breath**.\n\n**Fellwind Breath:** Melee. Wide 8 Cone. 12 Bash and Knockback 6. Anyone wallbanged by this suffers 1 Misfortune instead of the usual effect.",
      "Wanton Misfortune | *Ill Omen: Strike.*\nThe Monster’s Instinct becomes:\nPerform **Descent of Ill Fate** thrice at +3 Accuracy against each character with Misfortune. If no character has Misfortune, instead perform **Descent of Ill Fate** once at -3 Accuracy against each character\n\n**Descent of Ill Fate:** Melee, Infinity. Agile. 14 Bash. On-Hit: If you do not have Misfortune, take one instance of Misfortune. Otherwise, remove 1 instance of Misfortune and take a Bash Status."
    ],
    "IsPreview": false
  }