
  {
    "ID": "Centipede",
    "Name": "Sky Centipede",
    "Description": "Bearers of fickle winds, Sky Centipedes are blown about by the currents of pneuma that come with great misfortune and disastrous storms. Their segmented insectoid bodies are held aloft by a thousand and one wings, each flap stirring up ill omen and misfortune as they scurry through the air.",
    "Scale": 3,
    "Mechanics": "The X inflicts Misfortune with some of its actions. The current card will list a number of action types that are Ill Omens, when a character performs an action of that type, that character clears all Misfortune and takes 6 Typeless damage per Misfortune cleared. One instance of Misfortune can be cleared as an action.",
    "BasicAction": "If not adjacent to a target, move to the nearest target. Uses **Jaws That Catch** twice. Uses **Tail Whip** with remaining actions.\n**Step:** 4 Squares\n**Stride:** 10 Squares\n**Jaws That Catch:** Melee. 16 Typeless, On-Hit: Misfortune\n**Tail Whip:** The Sky Centipede’s tail rotates halfway around its head. All characters the tail moves adjacent to during this rotation are targeted by this Strike. Melee. 24 Bash.",
    "Size": "1x4, one end square is a designated Head",
    "ArmorClass": 13,
    "DamageThreshold": [
      190,
      190,
      191,
      192,
      193,
      194,
      195,
      195,
      195,
      196,
      197,
      198,
      199,
      199,
      205
    ],
    "AttackCards": [
      "Ill Winds Blow | *Ill Omen: Boost, Utility.*\nInstinct becomes: If not adjacent, move to the nearest target. Uses **Fickle Winds** with remaining actions, prioritizing hitting as many targets as possible.\n***Fickle Winds:*** *Melee. Normal 6 Cone. 18 Hollow, On-Hit: Misfortune.*",
      "Unrelenting Unluck | *Ill Omen: Utility, Defend.*\n**Tail Whip** gains Agile and rotates the entire way around the Sky Centipede’s head (effectively becoming a Starburst 3 centered on the head). Instinct becomes: If not adjacent, move to be within 3 squares of as many targets as possible. Uses **Tail Whip** with remaining actions.",
      "Whirlwind | *Ill Omen: Boost, Movement (Grimoire-granted Movement actions, not Stride and Step).*\nInflict Knockback 5 towards the Sky Centipede on all characters. Characters who end this Knockback adjacent to the Sky Centipede take 16 Typeless and Misfortune.",
      "Fickle Gale | *Ill Omen: Boost, Utility.*\nMelee. Wide 8 Cone. 12 Bash and Knockback 6.",
      "Wanton Misfortune | *Ill Omen: Strike.*\nInflict one Misfortune on all characters."
        ]
  }


