{
    "ID": "dhampir",
    "Name": "Bled-Dry Dhampirs",
    "Description": "Soulless husks, drained of blood and spirit. These monsters were humans once, now they are powerful thralls of the Red Ties making, hunting ravenously to fill the holes within them using the very tools that drained them in the first place.",
    "Scale": 4,
    "Mechanics": "The Bled-Dry Dhampirs are three individual entities on the map. When the Bled-Dry Dhampirs performs their instinct, each individual entity performs all listed actions. Strikes that target more than one entity deal half their damage again for each additional entity targeted on a hit. Other effects only apply to the Monster as a whole once, and affect each entity- except for Stun, each entity has its own Stun bar and is Stunned independently of all other entities.\n\nThe Bled-Dry Dhampirs create Bloody Mist terrain with some of their actions:\n**Bloody Mist:** Provides Partial Cover. Characters other than Bled-Dry Dhampirs who enter or end an action within Bloody Mist make a DC 15 Save or take 2 Rend and cannot perform Utility or Bane actions until the end of their next turn.",
    "Enrage": "Remove the most recently damaged Dhampir from the map. Remaining Dhampirs Step 6, prioritizing moving to include as many targets as possible with a Centered Starburst 4, and perform **Psychic Backlash**. Each square they leave during this movement is filled with Bloody Mist Terrain.\n\n**Psychic Backlash:** Targets in a Centered Starburst 4 make a DC 17 Save, on a failure they suffer 4 Shock. Targets inside multiple Starbursts make a save against each until they fail one.",
    "Stun": "The entity does not perform any actions this turn. Each entity can be stunned independently of each other entity, the additional value on Strikes only applies to Strikes that include that entity as a target.",
    "BasicAction": "If a target is not in Reach, Stride or Step to bring the closest target into Reach. Perform **Frenzy** until there is only one action remaining. With their last action, Step directly away from their last target\n\n**Stride:** 10 Squares.\n**Step:** 4 Squares.\n\n**Frenzy:** Melee. Reach. 10 Slash.",
    "Size": "3 1x1",
    "ArmorClass": 12,
    "DamageThreshold": 240,
    "EnrageThreshold": 40,
    "StunThreshold": 13,
    "AttackCards": [
      "Spare a Cigarette? | Utility. Each Bled-Dry Dhampir projects a Normal 4 Cone, prioritizing characters not already in another cone then prioritizing targeting as many characters as possible. Characters caught in a cone must make a DC15 Save or suffer \"Lose access to Grimoire actions you performed last turn. Recovery.\" and 6 Hollow. Characters caught in more than one cone suffer +3 Hollow per additional cone.",
      "Ice In The Veins | Utility. Each Bled-Dry Dhampir creates a Centered Starburst 2 of Icy terrain. Bled-Dry Dhampirs ignore this terrain when moving. Characters in the Starbursts when they are created make a DC18 Save against suffering 3 Shock statuses.", 
      "Rush Of Blood | When the Bled-Dry Dhampirs move this round, they do not provoke Lockdown and leave Bloody Mist terrain in every square they leave or enter, which lasts until the next time this card is drawn. They spend excess movement circling the target of their movement. Their Strikes this turn gain +2 Knockback, which they always follow.",
      "Withdrawals | The Monster's Instinct becomes:\nIf a target is not in Reach, Stride or Step to bring the closest target intoRreach. Perform **Withdrawal** until there is only one action remaining. With their last action, Step directly away from the last target.\n\n**Withdrawal:** Melee. Reach. 15 Slash. On-Hit: You have halved Stride distance. You may choose to take 1 damage at the end of your turn for the rest of combat to remove this effect.**",
      "The Gang's All Here | Before each Dhampir performs its Instinct, roll 1d6. That Dhampir gains or applies the effect of the result from the Cursed Items List. If there are fewer than 3 Dhampirs on the map, add one Dhampir at a randomly determined map edge.\n\n**Cursed Items:**\n**1] Mesmer Ring** - The target closest to this Dhampir makes a DC 17 save. On failure, they may not Strike this Dhampir next turn.\n**2] Cursing Lamp** - Creatures within a Centered Starburst 4 make a DC 17 save or suffer Ravage.\n**3] Mirror of Transposition** - The character adjacent to the most allies makes a DC 17 Save. On failure, they swap places with this Dhampir. If no characters are adjacent to each other, the character farthest from this Dhampir makes the same Save.\n**4] Ritual Knife** - This Dhampir’s strikes this turn gain On Hit : Apply Gutted and Flayed.\n**5] Cloak of Celerity** - This Dhampir's Step distance becomes 10.\n**6] Everflowing Goblet** - The character with the lowest health leaves Bloody Mist terrain in every square it leaves on its next turn. This terrain dissipates after 1 round."
    ],
    "IsPreview": false
  }