{
    "ID": "dhampire",
    "Name": "Bled-Dry Dhampirs",
    "Description": "Soulless husks, drained of blood and spirit. These monsters were humans once, now they are powerful thralls of the Red Ties making, hunting ravenously to fill the holes within them using the very tools that drained them in the first place.",
    "Scale": 4,
    "Mechanics": "The Bled-Dry Dhampirs are three individual entities on the map. When the Bled-Dry Dhampirs performs their instinct, each individual entity performs all listed actions. Each time 100 damage is dealt to the Bled-Dry Dhampirs, remove the most recently damaged entity from the map if there is more than one. Strikes that target more than one entity deal half their damage again for each additional entity targeted on a hit. Other effects only apply to the Monster as a whole once, and affect each entity.",
    "BasicAction": "If a target is not in Reach, Stride or Step to bring the closest target into reach. Spend all but one remaining action to perform **Frenzy**. Spend final action to Step directly away from the last target.\n\n**Step:** 4 Squares\n**Stride** 10 Squares\n\n**Frenzy:** Melee. Reach. 13 Slash.",
    "Size": "1x1, x3",
    "ArmorClass": 12,
    "DamageThreshold": 350,
    "AttackCards": [
      "Spare a Cigarette? | Each Bled-Dry Dhampir projects a Normal 4 Cone, prioritizing characters not already in another cone then prioritizing targeting as many characters as possible. Characters caught in a cone must make a DC15 Save or suffer \"Lose access to Grimoire actions you performed last turn. **Recovery**.\" and 10 Hollow. Characters caught in more than one cone suffer +5 Hollow per additional cone.",
      "Ice in the Veins | Each Bled-Dry Dhampir creates a Centered Starburst 2 of Icy terrain. Bled-Dry Dhampirs ignore this terrain when moving. Characters in the starbursts when they are created make a DC18 Save against suffering 3 Shock statuses.",
      "Blood is Money | When the Bled-Dry Dhampirs move this round, they do not provoke Lockdown and leave Bloody Mist terrain in every square they leave or enter, which lasts until the next time this card is drawn. They spend excess movement circling the target of their movement. Their Strikes this turn gain +2 KB, which they always follow.\n\n*Bloody Mist: Blocks line of sight. Characters other than Bled-Dry Dhampirs who enter or end an action within Bloody Mist take 4 Rend and cannot perform Utility or Bane actions until the end of their next turn.*",
      "Withdrawals | Instinct becomes:\nIf a target is not in Reach, Stride or Step to bring the closest target into reach. Then perform **Withdrawal**. Then Step directly away from the last target.\n\n**Withdrawal:** Melee. Reach. 18 Slash. On-Hit: You have halved Stride distance, you may choose to take 1 damage at the end of your turn for the rest of combat to remove this effect.",
      "Nothing Left to Give | When this card is drawn, until the next card is drawn if a Bled-Dry Dhampir is removed from the map, it explodes; all characters in a Centered Starburst 3 of it take 15 Burn. If there is less than three entities on the map, place another on a map edge. After the Bled-Dry Dhampirs take 50 damage, remove the most recently damaged entity from the map if there is more than one."
    ],
    "IsPreview": false
  }