{
    "ID": "golem",
    "Name": "Training Golem",
    "Description": "Robotic automatons used by NOIA to train new hunters. They are large, durable, and follow predictable patterns normally, but they have received plenty of upgrades to serve as part of the Grand Tourney. Beware the Self Destruct!",
    "Scale": 5,
    "Mechanics": "At the start of the fight, place a Tool Cache on two randomly determined map edges. When a character moves adjacent to a Tool Cache, remove it and they gain a single use of the **Hunter's Tools** Bane.\n\n**Hunter's Tools:** The Training Golem's Pneumic Arsenal becomes: Step or Stride to the nearest target, then perform Pneuma Flare.",
    "BasicAction": "Perform the actions listed in Pneumic Arsenal, then perform Pneuma Flare or Pneuma Bolt. Prioritize Pneuma Flare if it would hit multiple characters or if adjacent to a character, Pneuma Bolt otherwise.\n**Stride:** 6 Squares.\n**Step:** 4 Squares.\n**Pneuma Flare:** Melee, Centered Starburst 4, 18 Bash.\n**Pneuma Bolt:** Ranged, 8 Square range, 15 Hollow. +6 Accuracy.",
    "Size": "3x3",
    "ArmorClass": 11,
    "DamageThreshold": 375,
    "AttackCards": [
      "Instinct Shift: Aggressive | *Pneumic Arsenal: Stride towards the nearest character, then Pummel.*\nPneuma Flare has +2 Starburst size, deals +5 damage.\n\n**Pummel:** Melee, Reach, 20 Bash. On-Hit: Step, then if you end adjacent to a different character, Pummel them.",
      "Instinct Shift: Evasive | *Pneumic Arsenal: Stride out of adjacency, ignoring Lockdown, then Pneuma Bolt.*\nPneuma Bolt is a 1x100 line, has +3 Accuracy and +5 damage, and deals Pierces.", 
      "Curse-Seeking Missiles | *Pneumic Arsenal:* Micro-Missile Barrage, Micro-Missile Barrage.\nDesignate a Starburst 4 centered within 8 squares of the Training Golem, prioritizing targeting as many characters as possible. Characters within the starburst make a DC17 Save vs \"Ablaze, Engulf, then 15 Burn.\"\n\n**Micro-Missile Barrage:** Melee, Normal 6 Cone, 20 Burn.",
      "Devil-Slaying Blade | *Pneumic Arsenal:* Stride adjacent to the least damaged character, then Eradicate Devil.\nDesignate a 3x10 Line, prioritizing targeting as many characters as possible. All cover in that line is destroyed and that line becomes Rugged terrain. Characters Step to the nearest square outside of the line, then make a DC15 Save against two Rend statuses.\n\n**Eradicate Devil:** Melee, Centered Starburst 8, 20 Rend. On-Hit: Move the target to the opposite side of the Training Golem, then they take 8 Knockback.",
      "!!!CURSE 0VERL0AD!!! | *Pneumic Arsenal:* Stride, then !!!0VERL0AD!!!.\n\n **!!!0VERL0AD!!!:** Destroy all cover on the map, then destroy all Structures and Terrain. All characters take 15 Bash. Then perform Pneuma Flare. Place a Tool Cache on the two random map edges."
    ],
    "IsPreview": false
  }