{
    "ID": "hag",
    "Name": "Greycap Hag",
    "Description": "Elementals of frost and isolation, they spawn naturally on mountaintops and empty frozen plains where they use their powers to cause avalanches and snowstorms. The people isolated by the snow feeds them and their tamed blizzards. They spontaneously manifest in the wake of El Encantador, small frostbitten women straddled in heavy furs, flanked by claws of black ice.",
    "Scale": 5,
    "Mechanics": "The Greycap Hag begins the fight with two *Grasping Blizzards*. *Grasping Blizzards* are 2x2 characters who are placed two squares away on either side of the Hag. *Grasping Blizzards* possess Lockdown and three reactions shared between them. Each *Grasping Blizzard* has 60 HP. If the Greycap Hag hasn’t been targeted by a Strike this turn, all healing it receives is also shared with its *Grasping Blizzards*.",
    "BasicAction": "If any *Grasping Blizzards* remain, they both move (using one action), prioritizing characters who have performed a Ranged Strike on their turn, then they alternate performing **Clawing Frost** with remaining actions (they do not share MaP).\n Otherwise, if the Greycap Hag is not adjacent to a target, it moves. It uses **Cripple** with remaining actions.\n\n**Step:** 2 Squares\n**Stride:** 6 Squares\n\n**Clawing Frost:** Melee. All adjacent characters are targeted by this Strike. 19 Shock, On-Hit: The Greycap Hag heals 4 HP.\n**Cripple:** Melee. 16 Shock.",
    "Size": "1x1",
    "ArmorClass": 12,
    "DamageThreshold": 225,
    "AttackCards": [
      "Cast Out | Instinct becomes: If any *Grasping Blizzards* remain, one moves, positioning to target as many characters as it can with **Peak-Sweeping Gale**, then performs **Peak-Sweeping Gale** once. Otherwise, the Greycap Hag moves and performs **Peak-Sweeping Gale** once.\n***Peak-Sweeping Gale:*** *Normal 6 Cone. Melee. +3 to hit. 25 Shock, On-Hit: If performed by a Grasping Blizzard, the Graycap Hag heals 6.*",
      "Involuntary Recluse | Instinct becomes: If any *Grasping Blizzards* remain, they both move (using one action) until they are both adjacent to a different target, then each perform **Mountaintop Solitude**. Remaining actions are spent on **Clawing Frost**. Otherwise, the Greycap Hag moves and uses **Wrestle With Death** with remaining actions.\n***Mountaintop Solitude:*** *Force an adjacent character to make a DC18 Save vs the effects of the Grapple Quirk. Characters who fail this save take 10 Shock. While they are grappled in this way, they are Isolated.*\n***Wrestle With Death:*** *Melee. 18 Shock, On-Hit: You become Isolated next turn.*\n*Isolated - You are no-one’s ally and cannot see any square or treat any character as adjacent except for the purposes of Strikes.*",
      "Paint The Sky White | When this card is drawn all *Grasping Blizzards* are removed from the map and a 4x4 *Snowstorm* is placed centered on their space.\n*Snowstorms* are removed and all characters within them take 15 Shock, then the *Grasping Blizzards* return to the map. If there are no *Grasping Blizzards*, instead a 5x5 *Snowstorm* is placed centered on the Greycap Hag.\n*Snowstorm - Square AoE, edges block Line of Sight and actions cannot spread past their edge.*",
      "Grasping Frost | If there are one or less *Grasping Blizzards*, create one adjacent to the Greycap Hag. It has 20 HP. Otherwise, select a character, they make a DC23 Save vs 20 Shock. Other characters may opt to dive in, reducing the DC by 2 to a minimum of 15. On a failed save, characters who dove in take 10 Shock.",
      "A World In Ice | When this card is drawn, place *Grasping Blizzards* two squares away from the Greycap Hag until there are 4 *Grasping Blizzards*.\nThey have 12 HP and are destroyed at the end of this turn. Instinct becomes: If any *Grasping Blizzards* remain, they all move (using one action), prioritizing characters who have performed a Ranged Strike on their turn, then all performing **Clawing Frost** once (they do not share MaP). Otherwise,  if the Greycap Hag is not adjacent to a target, it moves. It uses **Cripple** with remaining actions."
    ],
    "IsPreview": true
  }

