{
    "ID": "mothman",
    "Name": "The Mothman",
    "Description": "With the city at its bleakest in the aftermath of El Encantador, several witnesses have reported a large, seven foot tall figure with glowing red eyes, a slender, muscular build, and large feathered wings. One report says that they were driving at over sixty miles per hour while it kept up with them on foot, screeching all the while. Those in the world of Curse know there's no mistake- Mothman has come to the city. There is no killing such a legend, only fending him off until he retreats.",
    "Scale": 6,
    "Mechanics": "At the start of your turn, each character makes a DC13 save versus *Feared*. Mothman has Lockdown and 3 reactions.",
    "BasicAction": "If a target is not in Reach, move to a target, prioritizing spending the least amount of actions and the furthest target. Use **Nightmare Claws** twice. Use remaining actions to **Screech**.\n\nIf there are *Feared* targets, it instead prioritizes moving towards the nearest *Feared* target and replaces **Nightmare Claws** with **Horrify**. \n\n**Step:** 4 Squares\n**Stride:** 10 Squares\n\n**Nightmare Claws:** Melee, Reach, 16 Rend, +3 Accuracy.\n**Horrify**: Melee, Reach, 9 Rend, 9 Hollow, +6 Accuracy.\n**Screech:** Centered Starburst 2, targets make a DC20 save. Each target that fails becomes *Feared* until the end of their next turn.\n\n*Feared: Strengthens some of The Mothman's actions, can be cleared by spending an action to Stride directly away from The Mothman.*",
    "Size": "2x2",
    "ArmorClass": 12,
    "DamageThreshold": 400,
    "AttackCards": [
      "Take Flight | Instinct becomes:\nThis turn, Mothman has a Step distance of 12, and a Stride distance of 24. Lockdown attacks against him have -3 Accuracy. After moving, if necessary, he uses **Harrowing Winds** twice, and **Nightmare Claws** with remaining actions. \n\n**Harrowing Winds**: Melee: 11 Pierce, 11 Hollow in a Normal 5 Cone.",
      "Terrorize | Instinct becomes: Mothman uses **Fearful Gaze** on the target with the most HP. On success, it uses **Soul Drain** on them with remaining actions. Otherwise, it follows its normal instinct for its remaining actions.\n\n**Fearful Gaze**: Ranged, 8 sq.: 15 Hollow, +9 Accuracy. On hit, target becomes *Feared*.\n\n**Soul Drain**: Ranged, 8 sq: 20 Hollow. On hit, apply Exhaust.",
      "Malevolent Swarm | The character with the least HP and every *Feared* character makes a DC15 Save, on a failure they have -4 Accuracy on their Strikes, take 10 Typeless damage, and suffer Daze.",
      "Haunting Burst | All Feared targets and all targets in Line of Sight must make a DC17 Save. On failure, they take 10 Hollow. The Mothman then Steps behind a target who failed their save, chosen randomly",
      "Blot Out the Sky | When this card is drawn, all squares further than 3 squares from The Mothman become Swarm terrain. This terrain lasts until the next time this card is drawn.\nCharacters not adjacent to The Mothman make a DC19 Save against 25 Rend and Tear Asunder.\n\n*Swarm:* Characters other than The Mothman who enter or end an action within this terrain must make a DC 15 save. On failure, they take 6 Rend, become Feared, and suffer a stacking -2 to Defend until the start of their next turn."
    ],
    "IsPreview": false
  }