{
  "ID": "neontalon",
  "Name": "The Neontalon Roc",
  "Description": "A creature born of gas and light, buoyed by electric life. From a distance, a beauty of the modern urban. From up close? A flashing death.",
  "Scale": 5,
  "Mechanics": "Begins every battle in Flight. While in Flight, Melee Strikes have -3 to hit this Monster, and it is immune to terrain and terrain effects. When a Melee Strike lands on the monster, you may reduce its damage by 8 to Ground the Roc, changing it to Grounded. Strikes dealing less then 8 damage take the difference in penalty to hit to be able to Ground the Roc.\nThis monster's Instinct and Cards will shift based on if it is in Flight, or Grounded.",
  "BasicAction": "If Flying, will use Neon Sun. Move into adjacency with as many warlocks as possible, then using Whirling Talons. Uses Uplift if Grounded. Uses remaining actions on Gas Devourer.\n\n**Step**: 4 Squares in Flight, 2 Squares in Grounded\n**Stride**: 12 Squares in Flight, 8 in Grounded\n\n**Neon Sun**: All targets within 5 squares and within LoS automatically take 5 Burn 5 Shock. Not a Strike.\n\n**Whirling Talon**: Melee. Targets all adjacent targets for 9 Slash 9 Rend.\n\n**Uplift**: Melee. Targets all adjacent targets for 14 Bash and *Knocked Back* 4.\n\n**Gas Devourer**: Ranged or Melee. Deals 9 Burn 9 Shock.",
  "Size": "3x3",
  "ArmorClass": 10,
  "DamageThreshold": 350,
  "AttackCards": [
    "Devastation of the Light | Randomly choose a target when this card is drawn. When activated, deal 40 damage to that target. Split this damage up evenly by Scale with all targets adjacent to that target.",
    "Gaseous Pillars | Create three 3x3 Pillars of light, each targetting as many characters as possible. Characters in the pillars must make a DC 18 Save against 15 Burn. Leaves *Flaming* Terrain, destroying all other terrain in a 7x7 centered on the pillars.",
    "Blinding Brilliance | All targets must make a DC 18 Save against 10 Shock and *Paralyzed*. Targets outside of Line of Sight gain +6 to this Save.",
    "Falling Star | The Instinct is changed to the following.\n\n If Flying, utilize Divebomb on as many targets as possible. Use remaining actions on Whirling Talons, except for the last Action, which is Uplift. If not flying, utilize Uplift first.\n\n**Divebomb**: Step up to 20 squares, then enter Grounded. All targets under you, or adjacent to your landing, defend against 10 Bash 7 Slash 7 Rend. Targets under you are then moved to adjacent to you.",
    "Neon Smite | This turn, the Neontalon may not be Grounded. The Instinct is changed to the following.\n\n.Utilize Starbomb with all actions, targetting as many characters as possible. Will attempt to use on multiple different clusters, starting with the most packed.\n\n**Starbomb**: Ranged. Step 2 Squares, then target a 5x5 area within 10 squares. All targets within defend against 10 Burn 10 Shock. Targetted area becomes *Flaming*."
  ]
}