{
    "ID": "revenant",
    "Name": "Vampiric Revenant",
    "Description": "Similar to wraiths and ghouls, the Vampiric Revenants are Ritualists and Hunters who were infected with vampiric curses and died- either from the curse itself or improperly executed after it fully settled over them. They return with a hunger for blood and vengeance, buoyed in strength by their own innate curse.",
    "Scale": 3,
    "Mechanics": "The Vampiric Revenant inflicts a *Blood Hex* with some of its actions. A character may only ever have one *Blood Hex* at a time. The Vampiric Revenant has Lockdown and infinite Reactions, but may only use it against characters with a *Blood Hex*. It performs Lockdown with Tear Throat, dealing 6 Rend and all other effects.",
    "Enrage": "All characters with *Blood Hex* clear their *Blood Hex* and take 6 Typeless. All characters without a *Blood Hex* gain a *Blood Hex*.\n\nThe Vampiric Revenant’s Instinct becomes: Move as necessary, prioritizing the closest character with a *Blood Hex*. Spend remaining actions on **Tear Throat** if there is a valid target, otherwise spend them on **Gruesome Hex**.",
    "Stun": "When the Monster would become Stunned, it consumes *Blood Hex* from a random character (if possible) to reduce its Stun by 6. That character may take 4 Typeless to negate this effect (at which point, it will do it again). If there are no instances of *Blood Hex* to consume, it becomes Stunned as normal.",
    "BasicAction": "If not adjacent, move as necessary, prioritizing the closest character. Perform **Cursed Blade** twice. Perform **Tear Throat** with remaining actions if there is a valid target, otherwise perform **Gruesome Hex**.\n\n**Stride:** 8 Squares.\n**Step:** 2 Squares.\n\n**Cursed Blade:** Melee. 16 Slash. On-Hit: The defender may reduce the damage by 6, if they do, suffer a *Blood Hex*\n**Tear Throat:** This Strike may only target a character with Blood Hex. Melee. Reach, Step adjacent to the target. 19 Rend, On-Hit: Clear Blood Hex and suffer a Hollow Status.\n**Gruesome Hex:** A random character within 6 Squares makes a DC17 Save. On a failure, they gain a *Blood Hex* and until they lose their *Blood Hex* they have -2 to Defend and -1 Value and -1 Stun on Boosts and Banes.",
    "Size": "2x2",
    "ArmorClass": 11,
    "DamageThreshold": 210,
    "EnrageThreshold": 75,
    "StunThreshold": 30,
    "AttackCards": [
      "Quicksilver Agility | The Vampiric Revenant’s Instinct becomes: “Perform **Quicksilver Agility** thrice.”\n\n**Quicksilver Agility:** Stride 6 Squares, prioritizing moving over as many characters as possible. Then perform this Strike against each character you Stride over. Melee. Agile. 17 Slash.",
      "Drown In Blood | The Vampiric Revenant’s Instinct becomes: “Move as necessary, prioritizing the closest character with *Blood Hex* who isn’t *Drowning*. Then perform **Drown In Blood**, moving if all valid targets are *Drowning*. Perform **Gruesome Hex** with remaining actions.”\n\n**Drown In Blood:** An adjacent character makes a DC17 Save. On a failure, they take 12 Rend immediately and begin Drowning. While Drowning, they take 2 damage any time they perform an Action, increased to 3 if it is a movement action.\n\nAt the end of their turn, a Drowning character may make a DC15 Save to clear this effect, with +2 to the Save for each time they have saved in this way before. On a successful save, if they have Blood Hex, they clear Blood Hex and treat themselves as if they failed the Save.", 
      "Chains of Viscera | When this card is drawn, randomly determine a character with *Blood Hex*. If there is not a character with *Blood Hex*, instead inflict *Blood Hex* on a random character and they are the target.\n\nWhen this card resolves, place 15 squares of Viscera adjacent to that character or another square of Viscera, prioritizing placing it under as many characters as possible. The target, and all characters in a square with Viscera, make a DC15 Save. On a failure, they suffer *Blood Hex*, or if they already have *Blood Hex*, 2 Hollow and *Concussed*.",
      "Expel Intent | Clear all terrain in an 8x8 centered on the Vampiric Revenant. Then designate a ring of Vile Darkness on the outermost edge of that area. Inflict 4 KB away from the Vampiric Revenant to all characters within the area, if this would result in a Wallbang or push a character into the Vile Darkness, they immediately save against Vile Darkness.\n\n*Vile Darkness: Characters moving into this area, or ending an action within it, must make a DC 17 Save or suffer Blood Hex and 6 Hollow. This area is Partial Cover.*",
      "DEMESNE EXPANSION: Infinite Gnashing | Designate a 10x10 centered on the Vampiric Revenant. The outer ring of this area are Walls. These Walls cannot be destroyed, removed, or replaced by any other effect. They can be entered by movement effects that ignore movement, but not exited. Other effects that ignore LoS cannot ignore these Walls. The Walls remain for 2 turns or until the Monster is Stunned.\n\nOn the turn this area is designated, all characters within the Walls make a DC17 Save, suffering Blood Hex on a failure. Its first action is always **Tear Throat**, which targets all valid targets within the Walls this turn."
    ],
    "IsPreview": false
  }