{
    "ID": "skeletalking",
    "Name": "Skeletal King",
    "Description": "Freakishly intelligent monsters who manifest in dark caverns and forgotten buildings. Watchers lure victims to its Demesne where they trap and toy with them before devouring them. Survivors have reported that the Watchers seem to be experimenting and studying their prey before finishing them off.",
    "Scale": 5,
    "Mechanics": "The Skeletal King leaves Calcitrant terrain in every square it leaves while moving.\n\n**Calcitrant Terrain:** Characters who enter or end an action in this terrain make a DC15 Save. On a failure, they gain 1 stack of *Bone Spur*. Characters take 1 additional damage when hit by a Strike from \"Skeletal\" enemies per *Bone Spur*.",
    "Enrage": "When the Skeletal King becomes Enraged, each character within 3sq makes a DC17 Save, taking 4 Bash on a failure. Then, remove the Skeletal King and place a 1x1 Skeletal Prince in its space, prioritizing placing it outside of adjacency. Place two additional Skeletal Princes, one next to the Character with the least stacks of *Bone Spur* and one next to the Character with the most. After placing the Princes, place the Skeletal King in the largest contiguous area of Calcitrant Terrain and then remove all Calcitrant Terrain from the map.\n\nSkeletal Princes perform their Instinct before the Skeletal King performs its card or Instinct. Skeletal Princes are destroyed by a single successful Strike against DC13, and deal the damage of that Strike as Typeless damage tothe Skeletal King.\n\n**Skeletal Prince:** Step up to 4 squares towards the closest Character, if necessary. Strike them with a Melee Strike, dealing 4 Slash + 1 Slash per stack of *Bone Spur* (in addition to the normal bonus damage from *Bone Spur*).",
    "Stun": "Skeletal Princes do not act while the Skeletal King is Stunned, all of the normal Stunned effects still apply.",
    "BasicAction": "If there is an adjacent character, perform **Ichor Flume**, otherwise perform **Bone Wheel**. Repeat this thrice.\n\n**Stride:** 7 Squares.\n**Step:** 2 Squares.\n\n**Ichor Flume:** Place Calcitrant Terrain in a 6x6 square centered on the Skeletal King, then target all targets in that area with this Strike. Melee. 8 Hollow. On-Hit: 4 Knockback which it does not follow.\n\n**Bone Wheel:** Stride towards the furthest Warlock it can reach with a single Stride, then target them with this Strike. Melee. 5 Rend.",
    "Size": "2x2",
    "ArmorClass": 10,
    "DamageThreshold": 300,
    "EnrageThreshold": 120,
    "StunThreshold": 40,
    "AttackCards": [
      "Pillars of Ivory | Each characer with a stack of *Bone Spur* explodes in a Starburst 2 centered on them. All characters within these Starbursts (including the exploding character) must make a DC12 Save, with a +1 to the DC for each stack of *Bone Spur* the exploding character has. On a failure, they suffer 4 Pierce. Characters must save against every Starburst they are in, but combine the damage from each failed Save.",
      "The Empire Grows | When this card is drawn, each character makes a DC15 Save. On a failure, they gain a stack of *Bone Spur*. This turn, characters with a stack of *Bone Spur* leave Calcitrant Terrain in each square they leave while moving (including through forced movement).", 
      "The Reach of the Ruler | The Skeletal King's Instinct becomes:\n Stride once, positioning to encompass as many characters in a 3x10 Line as possible. Perform **Ruler's Reach**. Perform **Ichor Flume** at +4 damage with remaining actions.\n\n**Ruler's Reach:** Melee. 3x10 Line. 10 Hollow. On-Hit: 6 Knockback towards the Skeletal King. Characters who would be moved into the Skeletal King's space take 2 Pierce instead.",
      "NYAHAHAHAHAHA | The Skeletal King's Instinct becomes:\nIf adjacent to character, Step out of adjacency. Perform **Derisive Laughter** with remaining actions, prioritizing characters with the most stacks of *Bone Spur*.\n\n**Derisive Laughter:** Ranged, 10 Squares. 10 Hollow. On-Hit: If the target doesn't have a stack of *Bone Spur*, they gain a stack. Otherwise, remove one stack and perform this Strike as an AoO from their square with halved base damage and range. Each character may only be targeted once per Action.",
      "Noblesse Oblige | Each character removes every stack of *Bone Spur* they are suffering from, to a maximum of 3. For each stack removed this way, that character places a Skeletal Tendril in an adjacent square of their choosing. Tendrils last until the end of the Skeletal King's next turn, or until the Skeletal King is Stunned.\n\nCharacters who perform a non-Movement action within 3 Squares of a Skeletal Tendril take 1 damage per Tendril within 3 Squares of them (this is damage from a Skeletal enemy)."
    ],
    "IsPreview": false
  }