{
    "ID": "tyrant",
    "Name": "The Sky Tyrant",
    "Description": "A bird-dragon hybrid in appearance, this monster is composed of the wishes and misgivings of the poor and hungry as they aspire to greater heights, corrupted by pneuma and collected into a manifestation born of greed and resentment. Sky Tyrants have been attracted to New York in droves, particularly dangerous as they seek to harass planes, high-rises and the rare flying warlock.",
    "Scale": 6,
    "Mechanics": "Must be fought on the [Tyrant's Domain](<https://docs.google.com/spreadsheets/d/13QKPCLclWrW6TPuXRm0McPE3BucnV1CHP_6cewmLmpg/edit?gid=1346460327#gid=1346460327>) map.\n\nThe Tyrant's Court consists of a number of floating Platforms (in black) and open air (in grey). You must place on a Platform. The Sky Tyrant always places in the center of the center Platform. If you begin your turn on a Platform, you can freely move through open air, you do not fall until the end of your turn. If you are forcibly moved off of a Plaform, you fall immediately. When you fall, you suffer 4 Bash. You cannot affect the Sky Tyrant in any way unless you are on a Platform. If you are not on a Platform, you must spend an action to jump to the nearest Platform, that is the only way to return to a Platform. Demesne walls do not stop people from falling or jumping back onto Platforms.\n\nWhen a Platform is destroyed, it returns after 2 rounds.\n\nWhen the Tyrant would have its movement stopped for any purpose, it instead takes 4 damage per Scale of the Source.",
    "Enrage": "The Tyrant Strikes the Platform with the most characters on it and two random Platforms. Platforms without characters are destroyed. If a Platform has one or more characters on it, those characters are targeted by a Melee Strike, at +2 Accuracy, dealing 14 Bash. If this Strike misses every character on a Platform, that Platform is destroyed.",
    "Stun": "When the Tyrant becomes Stunned, immediately return all Platforms, and all squares are considered a Platform. At the start of the next round, the Platforms lift off into the air again and all characters not on a Platform may freely move to the nearest Platform. All of the normal Stunned effects still apply.",
    "BasicAction": "Move towards the furthest character. Then, perform **Hand of the King** with remaining actions if there is an adjacent character. Otherwise, perform **King's Decree** with remaining actions, prioritizing the furthest target.\n\n**Stride:** 10 Squares.\n**Step:** 5 Squares.\n\n**Hand of the King:** Melee. 15 Bash. On-Hit: suffer 2 Knockback in any direction, pushing you towards the nearest edge of a Platform.\n**King's Decree:** Ranged. Size 9 Normal Cone. 12 Shock. On-Hit: suffer 2 Knockback in any direction, pushing you towards the nearest edge of a Platform.",
    "Size": "2x2",
    "ArmorClass": 12,
    "DamageThreshold": 360,
    "EnrageThreshold": 90,
    "StunThreshold": 40,
    "AttackCards": [
      "Taxing Squall | The Monster’s Instinct becomes:\nStep to the center Platform if not already there. Perform **Taxing Squall**. Then perform **Hand of the King** or **King’s Grasp** as normal with remaining action.\n\n**Taxing Squall:** Melee. Targets all targetable entities on the map. 8 Bash. On-Hit: inflict 8 Knockback towards the Sky Tyrant. On-Miss: 3 Knockback instead.",
      "Ruler of Skies Petulance | The Sky Tyrant’s Strikes have “On-Hit: Inflict Internal Injury.” If the Sky Tyrant’s first Strike is successful, it destroys the Platform the most targets were on.", 
      "Fellwinds | After the Sky Tyrant performs its Instinct, every character must make a DC15 Save or suffer 3 Knockback away from the Sky Tyrant.",
      "Pride Before the Fall | The character with the most HP makes a DC17 Save. On a failure, they take an additional 4 Knockback the next time they suffer Knockback. The next time they fall off a Platform, they suffer 8 Hollow.      ",
      "Wrath of the Mad Tyrant | When this card is drawn, randomly select a Platform and destroy it. Players on that Platform make a DC15 Save, moving to the nearest Platform on a success.\n\nThe Monster’s Instinct becomes:\nFreely Step adjacent to the character nearest to the edge of a Platform, then perform Hand of the King targeting that character. Repeat this thrice. Then return to the center Platform."
    ],
    "IsPreview": false
  }