{
    "ID": "watcher",
    "Name": "The Watcher In Wait",
    "Description": "Freakishly intelligent monsters who manifest in dark caverns and forgotten buildings. Watchers lure victims to its Demesne where they trap and toy with them before devouring them. Survivors have reported that the Watchers seem to be experimenting and studying their prey before finishing them off.",
    "Scale": 5,
    "Mechanics": "Must be fought on the [Eye of the Watcher](<https://docs.google.com/spreadsheets/d/13QKPCLclWrW6TPuXRm0McPE3BucnV1CHP_6cewmLmpg/edit?gid=1346460327#gid=1346460327>) map.\n\nThe Watcher never moves from the center of the map, effects the would inflict Knockback or forcibly move it instead deal 1 Typeless damage and 1 Stun for every 2 squares it would be moved.\n\nThe current card will list a number of directions that are considered to be in the Watcher's Vision:\n**The Watcher's Vision:** Anyone ending an action within The Watcher's Vision must make a DC15 Save. On a failure, they gain a stack of Beheld. Each stack of Beheld inflicts a -4 to one Defense against the Watcher, then that stack is cleared. Strikes made within The Watcher's Vision deal an additional 4 damage or Stun, chosen by the attacker. Strikes from outside the Watcher's Vision deal 2 less damage.",
    "Enrage": "While Enraged, every square is considered to be in The Watcher's Vision and the bonus to damage or Stun for Strikes made within The Watcher's Vision is no longer applied.",
    "Stun": "When the Watcher becomes Stunned, all characters clear half of their stacks of Beheld, or 2 stacks if they have 2 or less stacks, in addition to the normal Stunned effects.",
    "BasicAction": "Before performing the Monster's Instinct, if the Watcher is in a terrain effect it immediately saves against it, then clear that terrain. Perform **Spectate** thrice, prioritizing characters with the most stacks of Beheld, then prioritizing characters within The Watcher's Vision.\n\n**Spectate:** Melee, infinite range. 15 Burn, Hollow, or Shock",
    "Size": "3x3 in the center of the map.",
    "ArmorClass": 12,
    "DamageThreshold": 390,
    "EnrageThreshold": 125,
    "StunThreshold": 24,
    "AttackCards": [
      "Visual Learner | *Watcher’s Vision: South and SW*\n**Spectate** instead targets the character who performed the most non-Strike actions on their last turn, and targets a Starburst 2 centered on them. **Spectate** draws an additional Status this turn.",
      "Petrifying Gaze | *Watcher’s Vision: West and Northwest*\nUtility. All characters within The Watcher’s Vision make a DC17 Save. On a failure, they suffer *Petrifying Malaise*.\n\n**Petrifying Malaise:* All non-stride actions lose 3/5/7 Value per scale. You may take 3/5/7 damage to ignore this per action, otherwise Recovery 2.\n(Reminder: When reducing Value, you may reduce the Stun dealt by actions)", 
      "Disintegrating Leer | *Watcher’s Vision: North and Northeast*\n**Spectate** is replaced with **Sight Based Assimilation**.\n\n**Sight Based Assimilation:** Melee, infinite range. 13 Burn. On hit: Inflict Ablaze 4 times before drawing the Status.",
      "Beguile | *Watcher’s Vision: East and Southeast*\nWhen this card is drawn, for the rest of the round, when a character takes a stack of Beheld they make a DC15 Save. On failure, their first action next round must be a Stride ending within the Watcher’s Vision and you gain any amount of additional squares of movement necessary to reach the nearest square. You may take an additional stack of Beheld to automatically pass this Save.",
      "Devouring Eye (Monster) | *Watcher’s Vision: Two randomly determined directions*\nEveryone suffers 5 squares of Knockback towards the Watcher, plus an additional 5 squares for each stack of Beheld they have. Characters who end this Knockback adjacent to the Watcher suffer 4 Rend Statuses and a two stacks of Beheld."
    ],
    "IsPreview": false
  }