{
  "ID": "wraith",
  "Name": "The Hunter's Wraith",
  "Description": "The leftover dregs from a Hunter who fell in battle. The scraps of will and Curse still remain, becoming the very danger it lived to destroy.",
  "Scale": 3,
  "Mechanics": "The Wraith's movement ignores Impassability and Rugged Terrain, or similar effects. Has Lockdown, and 3 reactions.\nEthereal: +1 Accuracy.",
  "BasicAction": "If not adjacent, move to the lowest health target. Uses Clutched Weaponry twice. Uses Hunter's Hatred with remaining actions.\n\n**Step**: 3 Squares\n**Stride**: 10 Squares\n**Clutched Weaponry**: Melee. 8 Hollow 7 Pierce. Ethereal.\n\n**Hunter's Hatred**: DC 20 Save vs random Hex, as below. If you would gain a repeat hex, instead gain the next in line.\n*Hex of Wrath*: Gain +1 Accuracy your Strikes & must Strike twice each turn, but suffer -3 to defend.\n*Hex of Pride*: Do not gain benefits from your allies actions, and your actions may not benefit/be benefitted by allies. You have -1 to all rolls & Curse Die Size.\n*Hex of Envy*: Take 1 damage whenever an ally lands a Strike.\n*Hex of Sloth*: Your first Strike each turn has -3 value.\n*Hex of Gluttony*: Your Strides are halved distance & you cannot Stride more than once a turn\n*Hex of Lust*: You must remain within 2 squares of an ally at all times. If not, your first action must be to enter this range.\n*Hex of Greed*: Ignore your first Secondary Success each round.",
  "Size": "1x1",
  "ArmorClass": 13,
  "DamageThreshold": 180,
  "AttackCards": [
    "A Soul, Remembered | Randomly roll a Curse from below. Clutched Weaponry's damage changes to its type, and Ethereal is replaced with its effect. Then perform Awaken. If already used before, only perform the Awaken.\n\n**Awaken**: Deal 20 damage, split between the Curse Types, to the target with the lowest HP. Split this damage up evenly by Scale with all targets adjacent to that target.\n\nBlade that Scatters Flame: Slash and Burn. Ethereal now applies Ablaze.?\nSpear that Pierced the Heavens: Pierce and Shock. Ethereal now applies Jolt.\nThe Dagger in the Night: Slash and Rend. Ethereal now forces a DC 12 Save against Hunter's Hatred.\nHammer that Cracked the Iceberg: Bash and Shock. Ethereal now halves the target's next Stride. If this would stack, it instead reduces their next Step's distance by 1.\nAxe that Consumes All: Slash and Hollow. Ethereal now heals the Wraith for 2 on a hit.\nChains that Bind: Bash and Rend. Ethereal now counts as Reach, and +2 Cursed Die Size.\nFists that Take: Bash and Pierce. Ethereal now counts as +2 damage.",
    "Scream of the Lost | All characters within a centered starburst 5 must make a DC 18 Save. On a failure, they take -3 Accuracy, and halved Stride distance, with Recovery.",
    "Stalker's Glare | Hunter's Hatred is used twice at DC 13 against all targets within Line of Sight. When this card is drawn, The Hunter’s Wraith cannot perform Lockdown this turn.",
    "Go for the Kill | Instinct Shift: Utilize Pounce on the character who has used the most Ranged Strikes this fight within range, ties broken by the character with the least HP. Use remaining actions on Choke if Pounce succeeded, or Clutched Weaponry otherwise.\n\n**Pounce**: Step up to 12 squares. Then, force the enemy to make a DC 18 Save against **Grappled** and **Tripped**, as per the Quirks.\n\n**Choke**: Melee. 14 Hollow at +2 Accuracy. Ethereal.",
    "Carve for Profit | Instinct Shift: Utilize Apperate to become adjacent to the target with the most Hexes, ties broken by the character with the least HP. Utilize Drain with remaining actions.\n\n**Apperate**: Teleport anywhere as per a step.\n\n**Drain**: Melee. 10 Hollow, Ethereal. Each Hex on the target adds +2 Accuracy and +3 damage. Heal HP equal to the damage dealt."
  ]
}